common/src/test/resources/com/thenewmotion/ocpp/v12/heartbeatRequest.xml

<soap12:Envelope xmlns="urn://Ocpp/Cs/2010/08/" xmlns:soap12="http://www.w3.org/2003/05/soap-envelope">
    <soap12:Header>
        <chargeBoxIdentity>chargeBoxIdentity</chargeBoxIdentity>
    </soap12:Header>
    <soap12:Body>
        <heartbeatRequest/>
    </soap12:Body>
</soap12:Envelope>