ocpp-soap/src/test/resources/com/thenewmotion/ocpp/soap/v12/heartbeatRequest.xml

<soap12:Envelope xmlns="urn://Ocpp/Cs/2010/08/"
                 xmlns:soap12="http://www.w3.org/2003/05/soap-envelope"
                 xmlns:wsa="http://www.w3.org/2005/08/addressing">
    <soap12:Header>
        <chargeBoxIdentity>chargeBoxIdentity</chargeBoxIdentity>
        <wsa:ReplyTo>
            <wsa:Address>http://www.w3.org/2005/08/addressing/anonymous</wsa:Address>
        </wsa:ReplyTo>
    </soap12:Header>
    <soap12:Body>
        <heartbeatRequest/>
    </soap12:Body>
</soap12:Envelope>